app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    if @blog.save
---
INSERT INTO "blogs" ("title", "body", "img", "starRating", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "img" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "Mission Possible"], ["img", "https://canadianfeedthechildren.ca/wp-content/uploads/750x350-dark.png"], ["updated_at", "2018-08-16 23:11:11.743305"], ["id", 11]]